using BooksInfo.Entities;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BooksInfo.Data
{
   public static partial class StaticDataContext
    {
        public static ICollection<BookGiving> BookGivings { get; private set; }
        public static ICollection<Book> Books { get; private set; }

        private static string directory;
        public static string FileName { get; set; }
        private static string filePath;
        public static string Directory
        {
            get { return directory; }
            set
            {
                directory = value;
                if (!System.IO.Directory.Exists(directory))
                {
                    System.IO.Directory.CreateDirectory(directory);
                }
                filePath = directory + "/" + FileName;
            }
        }
        static StaticDataContext()
        {
            FileName = "BooksInfo.xml";
            filePath = FileName;

            BookGivings = new List<BookGiving>();
            Books = new List<Book>();
        }

        public static void CreateTestingData()
        {
            CreateBookGivings();
            CreateBooks();

            
        }

        private static void CreateBookGivings()
        {
            BookGivings = new List<BookGiving>()
            {
                new BookGiving()
                {
                    Id = 1,
                    ClassName = "11-A",
                    BookName = "Геометрія",
                    Author = "Бевз Микола",
                    DateGiving = "10.10.2020",
                    Note = "Геометрія — розділ математики, наука про просторові форми, відносини і їхні узагальнення. одна з найдавніших наук. Від початку вона була галуззю практичного знання, що розглядало довжини, площі, і об'єми. Початкові поняття геометрії виникли в результаті відволікання від будь-яких властивостей і відносин тіл, крім взаємного розташування і величини. Перші виражаються в дотику або приляганні тіл один до одного, в тому, що одне тіло є частиною іншого, в розташуванні «між», «всередині» тощо. Інші виражаються в поняттях «більше», «менше», в понятті про рівність тіл.",
                    Description = "https://uk.wikipedia.org/wiki/Геометрія"


                },
                 new BookGiving()
                {
                    Id = 2,
                    ClassName = "11-Б",
                    BookName = "Алгебра",
                    Author = "Бевз Микола",
                    DateGiving = "6.10.2020",
                    Note = "Алгебра — розділ математики, що вивчає математичні операції і відношення, та утворення, що базуються на них: многочлени, алгебраїчні рівняння, алгебраїчні структури. Вивчення властивостей композицій різного виду в XIX столітті привело до думки, що основне завдання алгебри — вивчення властивостей операцій незалежно від об'єктів, до яких вони застосовуються. З того часу алгебру стали розглядати як загальну науку про властивості та закони композиції операцій. У наші дні алгебра — одна з найважливіших частин математики, що має застосування як у суто теоретичних, так і в практичних галузях науки.",
                    Description = "https://uk.wikipedia.org/wiki/Алгебра"


                },
                  new BookGiving()
                {
                    Id = 3,
                    ClassName = "10-A",
                    BookName = "Англійська мова",
                    Author = "Мовчун Оксана",
                    DateGiving = "23.08.2020",
                    Note = "Англійська мова — мова, що належить до германської групи індоєвропейської сім'ї мов. Одна з найпоширеніших мов у світі, особливо як друга мова та мова міжнародного спілкування. Є офіційною у понад 60 суверенних державах, таких як Велика Британія, США, Канада, Австралія, Ірландія та Нова Зеландія, також поширена в Карибських країнах, Африці й у Південно-Східній Азії.",
                    Description = "https://uk.wikipedia.org/wiki/Англійська_мова"


                },
                   new BookGiving()
                {
                    Id = 4,
                    ClassName = "10-Б",
                    BookName = "Біологія",
                    Author = "Мамчур Остап",
                    DateGiving = "10.10.2020",
                    Note = "Біологія — система наук, що вивчає життя в усіх його проявах й на всіх рівнях організації живого, про живу природу, про істот, що заселяють Землю чи вже вимерли, їхні функції, розвиток особин і родів, спадковість, мінливість, взаємини, систематику, поширення на Землі; про зв'язки істот та їхні зв'язки з неживою природою. Біологія встановлює загальні закономірності, властиві життю в усіх його проявах.",
                    Description = "https://uk.wikipedia.org/wiki/Біологія"


                },
                   new BookGiving()
                {
                    Id = 5,
                    ClassName = "9-Г",
                    BookName = "Інформатика",
                    Author = "Карпов Михайло",
                    DateGiving = "19.10.2001",
                    Note = "Інформатика — теоретична та прикладна (технічна, технологічна) дисципліна, що вивчає структуру і загальні властивості інформації, а також методи і (технічні) засоби її створення, перетворення, зберігання, передачі та використання в різних галузях людської діяльності. Основне теоретичне завдання інформатики полягає у визначенні загальних закономірностей, відповідно до яких створюється інформація, відбувається її перетворення, передавання та використання у різних сферах діяльності людини. Прикладні завдання інформатики полягають у розробці найефективніших методів і засобів здійснення інформаційних процесів, у визначенні способів оптимальної наукової комунікації у самій науці та між наукою і виробництвом.",
                    Description = "https://uk.wikipedia.org/wiki/Інформатика"


                }
            };
        }

        private static void CreateBooks()
        {
            Books = new List<Book>()
            {
                new Book()
                {
                    Id = 1,
                    BookName = "Геометрія",
                    Author = "Бевз Микола",
                    Note = "Геометрія — розділ математики, наука про просторові форми, відносини і їхні узагальнення. одна з найдавніших наук. Від початку вона була галуззю практичного знання, що розглядало довжини, площі, і об'єми. Початкові поняття геометрії виникли в результаті відволікання від будь-яких властивостей і відносин тіл, крім взаємного розташування і величини. Перші виражаються в дотику або приляганні тіл один до одного, в тому, що одне тіло є частиною іншого, в розташуванні «між», «всередині» тощо. Інші виражаються в поняттях «більше», «менше», в понятті про рівність тіл.",
                    Description = "https://uk.wikipedia.org/wiki/Геометрія"


                },
                new Book()
                {
                    Id = 2,
                    BookName = "Алгебра",
                    Author = "Бевз Микола",
                    Note = "Алгебра — розділ математики, що вивчає математичні операції і відношення, та утворення, що базуються на них: многочлени, алгебраїчні рівняння, алгебраїчні структури. Вивчення властивостей композицій різного виду в XIX столітті привело до думки, що основне завдання алгебри — вивчення властивостей операцій незалежно від об'єктів, до яких вони застосовуються. З того часу алгебру стали розглядати як загальну науку про властивості та закони композиції операцій. У наші дні алгебра — одна з найважливіших частин математики, що має застосування як у суто теоретичних, так і в практичних галузях науки.",
                    Description = "https://uk.wikipedia.org/wiki/Алгебра"


                },
                new Book()
                {
                    Id = 3,
                    BookName = "Англійська мова",
                    Author = "Мовчун Оксана",
                    Note = "Англійська мова — мова, що належить до германської групи індоєвропейської сім'ї мов. Одна з найпоширеніших мов у світі, особливо як друга мова та мова міжнародного спілкування. Є офіційною у понад 60 суверенних державах, таких як Велика Британія, США, Канада, Австралія, Ірландія та Нова Зеландія, також поширена в Карибських країнах, Африці й у Південно-Східній Азії.",
                    Description = "https://uk.wikipedia.org/wiki/Англійська_мова"


                },
                  new Book()
                {
                    Id = 4,
                    BookName = "Біологія",
                    Author = "Мамчур Остап",
                    Note = "Біологія — система наук, що вивчає життя в усіх його проявах й на всіх рівнях організації живого, про живу природу, про істот, що заселяють Землю чи вже вимерли, їхні функції, розвиток особин і родів, спадковість, мінливість, взаємини, систематику, поширення на Землі; про зв'язки істот та їхні зв'язки з неживою природою. Біологія встановлює загальні закономірності, властиві життю в усіх його проявах.",
                    Description = "https://uk.wikipedia.org/wiki/Біологія"


                },
                  new Book()
                {
                    Id = 5,
                    BookName = "Інформатика",
                    Author = "Карпов Михайло",
                    Note = "Інформатика — теоретична та прикладна (технічна, технологічна) дисципліна, що вивчає структуру і загальні властивості інформації, а також методи і (технічні) засоби її створення, перетворення, зберігання, передачі та використання в різних галузях людської діяльності. Основне теоретичне завдання інформатики полягає у визначенні загальних закономірностей, відповідно до яких створюється інформація, відбувається її перетворення, передавання та використання у різних сферах діяльності людини. Прикладні завдання інформатики полягають у розробці найефективніших методів і засобів здійснення інформаційних процесів, у визначенні способів оптимальної наукової комунікації у самій науці та між наукою і виробництвом.",
                    Description = "https://uk.wikipedia.org/wiki/Інформатика"

                }
            };
        }
    }
}
